using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ISIP424_Chirkina
{
    internal class Program
    {
        static void Main(string[] args)
        {
          
        }
    }
}
/*Создайте консольное приложение, в котором должна быть регистрация пользователя с подтверждением пароля, просмотр товаров (даже для незарегистрированного пользователя). 
 *Должна быть корзина товаров и покупка как одного предмета, так и всех предметов из всей корзины сразу. 
 *При покупке, пользователь должен выбирать ПВЗ (пункт выдачи заказов) из доступных. 
 *Должен быть функционал для просмотра заказов с сортировкой по дате, когда был сделан заказ. 
 *Также, реализуйте возможность зайти в аккаунт уже зарегистрированного пользователя.*/

// Ник, пасс, товары, история покупок, корзина(один/несколько айт.)